package main

import "fmt"

func main() {
	x := 0
	for true{
		fmt.Scan(&x)
		fmt.Printf("整数: %d, 左移一位后: %d, 右移一位后: %d\n",x,x<<1,x>>1)
	}
}
/*
	0
	整数: 0, 左移一位后: 0, 右移一位后: 0
	1
	整数: 1, 左移一位后: 2, 右移一位后: 0
	2
	整数: 2, 左移一位后: 4, 右移一位后: 1
	3
	整数: 3, 左移一位后: 6, 右移一位后: 1
	10
	整数: 10, 左移一位后: 20, 右移一位后: 5
	11
	整数: 11, 左移一位后: 22, 右移一位后: 5
	-5
	整数: -5, 左移一位后: -10, 右移一位后: -3
	-4
	整数: -4, 左移一位后: -8, 右移一位后: -2
	2147483648
	整数: 2147483648, 左移一位后: 4294967296, 右移一位后: 1073741824
	9223372036854775807
	整数: 9223372036854775807, 左移一位后: -2, 右移一位后: 4611686018427387903
	-9223372036854775808
	整数: -9223372036854775808, 左移一位后: 0, 右移一位后: -4611686018427387904
*/
/*
	总结
	1. go语言的移位运算是算数移位，其中右移运算。腾出来的位置是用符号位去补充的。
*/
